## Terraform Plan Results

| Step | Status |
|------|--------|
| 🖌️ Format | ✅ Passed |
| ⚙️ Init | ✅ Passed |
| 📝 Validate | ✅ Passed |
| 📋 Plan | ✅ Passed |

<details>
<summary>Show Plan Output</summary>

```terraform
data.archive_file.lambda: Reading...
cloudflare_turnstile_widget.ifs_widget: Refreshing state... [id=0x4AAAAAACC1jetWzl31A2VS]
cloudflare_record.cloudfront_to_ifs_cname: Refreshing state... [id=e18237ce958691807fc42c96469ad21a]
data.archive_file.lambda: Read complete after 0s [id=6a8e59c4f3b301ef9096280c6dcfbde3ca87f227]
aws_acm_certificate.subdomain_cert: Refreshing state... [id=arn:aws:acm:us-east-1:533267177082:certificate/4cc8d0f9-09a7-4203-87b8-be277761b20f]
aws_cloudfront_origin_access_identity.oai: Refreshing state... [id=E1CER2APENQ1UU]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_role]
aws_s3_bucket_cors_configuration.allow_ifs_cors: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket.main_bucket: Refreshing state... [id=ifs-storage-bucket]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
cloudflare_record.acm_certificate_cname: Refreshing state... [id=cfc0a223b0d041b0e58c7247fe063ddd]
aws_lambda_function.upload_function: Refreshing state... [id=upload_function]
aws_lambda_function_url.upload_function_url: Refreshing state... [id=upload_function]
aws_s3_bucket_public_access_block.allow_public_acl: Refreshing state... [id=ifs-storage-bucket]
aws_iam_policy.allow_s3_access: Refreshing state... [id=arn:aws:iam::533267177082:policy/allow_s3_policy]
aws_s3_bucket_website_configuration.s3_site_config: Refreshing state... [id=ifs-storage-bucket]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E2C9XYLKDNE51M]
aws_s3_object.index_html: Refreshing state... [id=index.html]
aws_s3_bucket_lifecycle_configuration.one_day_lifetime: Refreshing state... [id=ifs-storage-bucket]
aws_s3_bucket_policy.main_bucket_policy: Refreshing state... [id=ifs-storage-bucket]
aws_iam_role_policy_attachment.combined_policy_attachment: Refreshing state... [id=lambda_role-20251125123608469300000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "E2C9XYLKDNE51M"
        tags                            = {}
        # (24 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ target_origin_id           = "IfsS3Origin" -> "ifs-s3-origin"
            # (15 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "ifs-storage-bucket.s3.ap-southeast-1.amazonaws.com" -> null
          - origin_id                   = "IfsS3Origin" -> null
          - response_completion_timeout = 0 -> null
            # (2 unchanged attributes hidden)

          - s3_origin_config {
              - origin_access_identity = "origin-access-identity/cloudfront/E1CER2APENQ1UU" -> null
            }
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "ifs-storage-bucket.s3.ap-southeast-1.amazonaws.com"
          + origin_id                   = "ifs-s3-origin"
          + response_completion_timeout = (known after apply)
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = "origin-access-identity/cloudfront/E1CER2APENQ1UU"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.allow_s3_access must be replaced
-/+ resource "aws_iam_policy" "allow_s3_access" {
      ~ arn              = "arn:aws:iam::533267177082:policy/allow_s3_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ description      = "Grant access toS3" -> "Grant access to S3 for ifs" # forces replacement
      ~ id               = "arn:aws:iam::533267177082:policy/allow_s3_policy" -> (known after apply)
      ~ name             = "allow_s3_policy" -> "ifs_s3_access_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAXYKJTLZ5NX7BUIW7G" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role.lambda_role must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::533267177082:role/lambda_role" -> (known after apply)
      ~ create_date           = "2025-11-25T12:36:08Z" -> (known after apply)
      ~ id                    = "lambda_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::533267177082:policy/allow_s3_policy",
        ] -> (known after apply)
      ~ name                  = "lambda_role" -> "ifs_lambda_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAXYKJTLZ5JTZT2XFI2" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy {
          + arn                   = (known after apply)
          + assume_role_policy    = (known after apply)
          + create_date           = (known after apply)
          + description           = (known after apply)
          + force_detach_policies = (known after apply)
          + id                    = (known after apply)
          + managed_policy_arns   = (known after apply)
          + max_session_duration  = (known after apply)
          + name                  = (known after apply)
          + name_prefix           = (known after apply)
          + path                  = (known after apply)
          + permissions_boundary  = (known after apply)
          + tags                  = (known after apply)
          + tags_all              = (known after apply)
          + unique_id             = (known after apply)
        } -> (known after apply)
    }

  # aws_iam_role_policy_attachment.combined_policy_attachment must be replaced
-/+ resource "aws_iam_role_policy_attachment" "combined_policy_attachment" {
      ~ id         = "lambda_role-20251125123608469300000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::533267177082:policy/allow_s3_policy" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "lambda_role" -> "ifs_lambda_role" # forces replacement
    }

  # aws_lambda_function.upload_function must be replaced
-/+ resource "aws_lambda_function" "upload_function" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function" -> (known after apply)
      ~ code_sha256                    = "HT9E8CoDr1DBqrHx2R+2HMqULFEpPTaCjh0z92JUYaQ=" -> (known after apply)
      ~ function_name                  = "upload_function" -> "ifs_upload_function" # forces replacement
      ~ id                             = "upload_function" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function/invocations" -> (known after apply)
      ~ last_modified                  = "2025-11-25T12:36:26.509+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function:$LATEST/invocations" -> (known after apply)
      ~ response_streaming_invoke_arn  = "arn:aws:apigateway:ap-southeast-1:lambda:path/2021-11-15/functions/arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function/response-streaming-invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::533267177082:role/lambda_role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 1164 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "TURNSTILE_SECRET_KEY" = (sensitive value)
            } -> (known after apply)
        }

      ~ ephemeral_storage {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + publish_to                         = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + region                             = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + response_streaming_invoke_arn      = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + source_kms_key_arn                 = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)

      ~ logging_config {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + publish_to                         = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + region                             = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + response_streaming_invoke_arn      = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + source_kms_key_arn                 = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)

      ~ tracing_config {
          + architectures                      = (known after apply)
          + arn                                = (known after apply)
          + code_sha256                        = (known after apply)
          + code_signing_config_arn            = (known after apply)
          + description                        = (known after apply)
          + filename                           = (known after apply)
          + function_name                      = (known after apply)
          + handler                            = (known after apply)
          + id                                 = (known after apply)
          + image_uri                          = (known after apply)
          + invoke_arn                         = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + layers                             = (known after apply)
          + memory_size                        = (known after apply)
          + package_type                       = (known after apply)
          + publish                            = (known after apply)
          + publish_to                         = (known after apply)
          + qualified_arn                      = (known after apply)
          + qualified_invoke_arn               = (known after apply)
          + region                             = (known after apply)
          + replace_security_groups_on_destroy = (known after apply)
          + replacement_security_group_ids     = (known after apply)
          + reserved_concurrent_executions     = (known after apply)
          + response_streaming_invoke_arn      = (known after apply)
          + role                               = (known after apply)
          + runtime                            = (known after apply)
          + s3_bucket                          = (known after apply)
          + s3_key                             = (known after apply)
          + s3_object_version                  = (known after apply)
          + signing_job_arn                    = (known after apply)
          + signing_profile_version_arn        = (known after apply)
          + skip_destroy                       = (known after apply)
          + source_code_hash                   = (known after apply)
          + source_code_size                   = (known after apply)
          + source_kms_key_arn                 = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + timeout                            = (known after apply)
          + version                            = (known after apply)
        } -> (known after apply)
    }

  # aws_lambda_function_url.upload_function_url must be replaced
-/+ resource "aws_lambda_function_url" "upload_function_url" {
      ~ function_arn       = "arn:aws:lambda:ap-southeast-1:533267177082:function:upload_function" -> (known after apply)
      ~ function_name      = "upload_function" -> "ifs_upload_function" # forces replacement
      ~ function_url       = "https://qdimyb3q57nvzffgta2d37wu3u0jsmrj.lambda-url.ap-southeast-1.on.aws/" -> (known after apply)
      ~ id                 = "upload_function" -> (known after apply)
      ~ url_id             = "qdimyb3q57nvzffgta2d37wu3u0jsmrj" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_cors_configuration.allow_cors will be created
  + resource "aws_s3_bucket_cors_configuration" "allow_cors" {
      + bucket = "ifs-storage-bucket"
      + id     = (known after apply)
      + region = "ap-southeast-1"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://ifs.kenf.dev",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_cors_configuration.allow_ifs_cors will be destroyed
  # (because aws_s3_bucket_cors_configuration.allow_ifs_cors is not in configuration)
  - resource "aws_s3_bucket_cors_configuration" "allow_ifs_cors" {
      - bucket                = "ifs-storage-bucket" -> null
      - id                    = "ifs-storage-bucket" -> null
      - region                = "ap-southeast-1" -> null
        # (1 unchanged attribute hidden)

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "POST",
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "https://ifs.kenf.dev",
            ] -> null
          - expose_headers  = [
              - "ETag",
            ] -> null
            id              = null
          - max_age_seconds = 3000 -> null
        }
    }

  # aws_s3_object.index_html will be updated in-place
  ~ resource "aws_s3_object" "index_html" {
      ~ content                       = <<-EOT
            <!DOCTYPE html>
            <html lang="en">
              <head>
                <meta charset="UTF-8" />
                <meta name="viewport" content="width=device-width, initial-scale=1.0" />
            
                <title>IFS - Insecure File Service</title>
                <meta
                  name="description"
                  content="Insecurely transfer files between devices connected to the internet."
                />
                <meta
                  name="keywords"
                  content="file sharing, file transfer, online file sharing, share files online"
                />
                <meta name="robots" content="index, follow" />
                <link rel="canonical" href="https://ifs.kenf.dev/" />
            
                <link
                  rel="stylesheet"
                  href="https://fonts.googleapis.com/css2?family=Inter:wght@400;500;600&display=swap"
                />
                <script
                  src="https://challenges.cloudflare.com/turnstile/v0/api.js"
                  async
                  defer
                ></script>
                <style>
                  :root {
                    --primary: #4f46e5;
                    --primary-hover: #4338ca;
                    --gray-50: #f9fafb;
                    --gray-100: #f3f4f6;
                    --gray-200: #e5e7eb; /* Used for disabled button background */
                    --gray-300: #d1d5db;
                    --gray-500: #6b7280; /* Can be used for disabled text if --gray-700 is too dark */
                    --gray-700: #374151; /* Used for disabled button text and footer text */
                    --gray-800: #1f2937;
                    --red-500: #ef4444;
                    --green-500: #10b981;
                  }
            
                  * {
                    box-sizing: border-box;
                    margin: 0;
                    padding: 0;
                  }
            
                  body {
                    font-family: "Inter", -apple-system, BlinkMacSystemFont, sans-serif;
                    background: linear-gradient(135deg, #f5f7fa 0%, #eef1f5 100%);
                    color: var(--gray-800);
                    min-height: 100vh;
                    display: flex;
                    flex-direction: column;
                    justify-content: center;
                    align-items: center;
                    line-height: 1.5;
                  }
            
                  .container {
                    display: flex;
                    max-width: 900px;
                    width: 90%;
                    background-color: white;
                    border-radius: 16px;
                    box-shadow: 0 10px 25px rgba(0, 0, 0, 0.05);
                    overflow: hidden;
                    margin-top: auto;
                    margin-bottom: 1rem; /* Add some margin below container before footer */
                  }
            
                  .panel {
                    flex: 1;
                    padding: 2.5rem;
                    display: flex;
                    flex-direction: column;
                  }
            
                  .divider {
                    width: 1px;
                    background-color: var(--gray-200);
                  }
            
                  h2 {
                    font-weight: 600;
                    font-size: 1.5rem;
                    margin-bottom: 1.5rem;
                    color: var(--gray-800);
                  }
            
                  .upload-area {
                    border: 2px dashed var(--gray-300);
                    border-radius: 8px;
                    padding: 2rem;
                    text-align: center;
                    margin-bottom: 1.5rem;
                    transition: all 0.2s;
                    cursor: pointer;
                    height: 180px;
                    width: 100%;
                    flex-direction: column;
                    justify-content: center;
                    align-items: center;
                    overflow: hidden;
                  }
            
                  .upload-area:hover {
                    border-color: var(--primary);
                    background-color: var(--gray-50);
                  }
            
                  .upload-icon {
                    font-size: 2rem;
                    margin-bottom: 0.5rem;
                    color: var(--gray-700);
                  }
            
                  .file-input {
                    display: none;
                  }
            
                  .button {
                    background-color: var(--primary);
                    color: white;
                    border: none;
                    border-radius: 8px;
                    padding: 0.75rem 1.5rem;
                    font-size: 1rem;
                    font-weight: 500;
                    cursor: pointer;
                    transition: background-color 0.2s, color 0.2s;
                    width: 100%;
                  }
            
                  .button:hover {
                    background-color: var(--primary-hover);
                  }
            
                  .button:disabled,
                  .button[disabled] {
                    background-color: var(--gray-200) !important;
                    color: var(--gray-700) !important;
                    cursor: not-allowed;
                  }
            
                  .button:disabled:hover,
                  .button[disabled]:hover {
                    background-color: var(--gray-200) !important;
                    color: var(--gray-700) !important;
                  }
            
                  .output {
                    margin-top: 1.5rem;
                    padding: 1rem;
                    border-radius: 8px;
                    background-color: var(--gray-100);
                    height: 6rem;
                    max-height: 6rem;
                    overflow-y: auto;
                    white-space: pre-wrap;
                    font-size: 0.9rem;
                  }
            
                  .success {
                    color: var(--green-500);
                    font-weight: 500;
                  }
            
                  .error {
                    color: var(--red-500);
                  }
            
                  .search-input {
                    width: 100%;
                    padding: 0.75rem 1rem;
                    border: 1px solid var(--gray-300);
                    border-radius: 8px;
                    font-size: 1rem;
                    margin-bottom: 1rem;
                    transition: border-color 0.2s;
                  }
            
                  .search-input:focus {
                    outline: none;
                    border-color: var(--primary);
                    box-shadow: 0 0 0 3px rgba(79, 70, 229, 0.1);
                  }
            
                  .loading {
                    display: inline-block;
                    width: 1rem;
                    height: 1rem;
                    border: 2px solid rgba(255, 255, 255, 0.3);
                    border-radius: 50%;
                    border-top-color: white;
                    animation: spin 0.8s linear infinite;
                    margin-right: 0.5rem;
                    vertical-align: middle;
                  }
            
                  @keyframes spin {
                    to {
                      transform: rotate(360deg);
                    }
                  }
            
                  @media (max-width: 768px) {
                    .container {
                      flex-direction: column;
                      width: 95%;
                      margin-top: 1rem;
                      margin-bottom: 1rem;
                    }
            
                    .panel {
                      padding: 1.5rem;
                    }
            
                    .divider {
                      width: 100%;
                      height: 1px;
                    }
                  }
            
                  footer {
                    text-align: center;
                    padding: 1.5rem;
                    font-size: 0.9rem;
                    color: var(--gray-700);
                    margin-top: auto;
                    width: 100%;
                  }
            
                  footer a {
                    color: var(--primary);
                    text-decoration: none;
                  }
            
                  footer a:hover {
                    text-decoration: underline;
                  }
                </style>
              </head>
              <body>
                <div class="container">
                  <div class="panel">
                    <h2>upload file</h2>
                    <div class="upload-area" id="uploadArea">
                      <div class="upload-icon">📤</div>
                      <p>drag & drop your file here<br />or click to browse</p>
                      <input type="file" id="fileInput" class="file-input" />
                    </div>
            
                    <!-- Cloudflare Turnstile Widget -->
                    <div
                      class="cf-turnstile"
                      data-sitekey="0x4AAAAAACC1jetWzl31A2VS"
                      data-callback="turnstileCallback"
                    ></div>
                    <br />
            
                    <button id="uploadButton" class="button" disabled>upload file</button>
                    <div id="output" class="output"></div>
                  </div>
            
                  <div class="divider"></div>
            
                  <div class="panel">
                    <h2>access shared file</h2>
                    <input
                      type="text"
                      id="fileNameInput"
                      class="search-input"
                      placeholder="enter file hash (e.g., a1b2)"
                    />
                    <button
                      id="accessFileButton"
                      onclick="redirectToFile()"
                      class="button"
                      disabled
                    >
                      access file
                    </button>
                  </div>
                </div>
            
                <script>
                  const uploadArea = document.getElementById("uploadArea");
                  const fileInput = document.getElementById("fileInput");
                  const uploadButton = document.getElementById("uploadButton");
                  const outputDiv = document.getElementById("output");
                  const fileNameInput = document.getElementById("fileNameInput");
                  const accessFileButton = document.getElementById("accessFileButton");
            
                  uploadArea.addEventListener("click", () => fileInput.click());
            
                  ["dragenter", "dragover", "dragleave", "drop"].forEach((eventName) => {
                    uploadArea.addEventListener(eventName, preventDefaults, false);
                  });
            
                  function preventDefaults(e) {
                    e.preventDefault();
                    e.stopPropagation();
                  }
            
                  ["dragenter", "dragover"].forEach((eventName) => {
                    uploadArea.addEventListener(eventName, highlight, false);
                  });
            
                  ["dragleave", "drop"].forEach((eventName) => {
                    uploadArea.addEventListener(eventName, unhighlight, false);
                  });
            
                  function highlight() {
                    uploadArea.style.borderColor = getComputedStyle(
                      document.documentElement
                    ).getPropertyValue("--primary");
                    uploadArea.style.backgroundColor = getComputedStyle(
                      document.documentElement
                    ).getPropertyValue("--gray-50");
                  }
            
                  function unhighlight() {
                    uploadArea.style.borderColor = "";
                    uploadArea.style.backgroundColor = "";
                  }
            
                  uploadArea.addEventListener("drop", handleDrop, false);
            
                  function handleDrop(e) {
                    const dt = e.dataTransfer;
                    const files = dt.files;
                    if (files.length > 0) {
                      fileInput.files = files;
                      checkUploadButtonState();
                    }
                  }
            
                  fileInput.addEventListener("change", checkUploadButtonState);
            
                  function checkUploadButtonState() {
                    if (fileInput.files.length > 0) {
                      uploadButton.disabled = false;
                      uploadArea.innerHTML = `<div class="upload-icon">📄</div><p>${fileInput.files[0].name}</p>`;
                    } else {
                      uploadButton.disabled = true;
                      uploadArea.innerHTML = `
                        <div class="upload-icon">📤</div>
                        <p>drag & drop your file here<br>or click to browse</p>
                      `;
                    }
                  }
            
                  uploadButton.addEventListener("click", uploadFile);
            
                  function uploadFile() {
                    uploadButton.disabled = true;
                    uploadButton.innerHTML = `<span class="loading"></span>uploading...`;
            
                    const file = fileInput.files[0];
            
                    if (!file) {
                      showError("please select a file first.");
                      return;
                    }
            
                    const maxSize = 500 * 1024 * 1024; // 500MB
                    if (file.size > maxSize) {
                      showError("file size exceeds 500MB limit.");
                      return;
                    }
            
                    const reader = new FileReader();
                    reader.onload = function (event) {
                      appendLog(`🗃️ processing file: ${file.name}`);
            
                      // Get Turnstile token
                      const turnstileToken = turnstile.getResponse();
                      if (!turnstileToken) {
                        showError("please verify you are human.");
                        return;
                      }
            
                      const payload = {
                        original_filename: file.name,
                        turnstile_token: turnstileToken,
                      };
            
                      const apiUrl = "https://qdimyb3q57nvzffgta2d37wu3u0jsmrj.lambda-url.ap-southeast-1.on.aws/";
                      fetch(apiUrl, {
                        method: "POST",
                        headers: { "Content-Type": "application/json" },
                        body: JSON.stringify(payload),
                      })
                        .then((response) => {
                          if (!response.ok) {
                            return response.text().then((text) => {
                              throw new Error(
                                `Error fetching presigned URL (${response.status}): ${
                                  text || response.statusText
                                }`
                              );
                            });
                          }
                          return response.json();
                        })
                        .then((data) => {
                          if (
                            !data.upload_url ||
                            !data.upload_url.url ||
                            !data.upload_url.fields ||
                            !data.file_id
                          ) {
                            throw new Error("Invalid presigned URL data received.");
                          }
                          const presignedUrl = data.upload_url.url;
                          const fileId = data.file_id;
                          const formData = new FormData();
                          console.log(data.upload_url.fields);
                          Object.keys(data.upload_url.fields).forEach((key) => {
                            formData.append(key, data.upload_url.fields[key]);
                          });
                          formData.append("file", file);
                          console.log(formData);
                          return fetch(presignedUrl, {
                            method: "POST",
                            body: formData,
                          }).then((uploadResponse) => {
                            return { uploadResponse, fileId };
                          });
                        })
                        .then(({ uploadResponse, fileId }) => {
                          if (uploadResponse.ok) {
                            appendLog(
                              `🎉 upload successful!\n     access with code: <strong class="success">${fileId}</strong>\n     or at <a href="/${fileId}" target="_blank" rel="noopener noreferrer">https://ifs.kenf.dev/${fileId}</a>\n`,
                              "success"
                            );
                            uploadButton.innerHTML = "upload file";
                            resetUploadArea();
                          } else {
                            return uploadResponse.text().then((text) => {
                              throw new Error(
                                `Error uploading to S3 (${uploadResponse.status}): ${
                                  text || uploadResponse.statusText
                                }`
                              );
                            });
                          }
                        })
                        .catch((error) => {
                          showError(`upload failed: ${error.message}`);
                        });
                    };
                    reader.onerror = function () {
                      showError("Error reading file.");
                      uploadButton.innerHTML = "upload file";
                      resetUploadArea();
                    };
                    reader.readAsBinaryString(file);
                  }
            
                  function showError(message) {
                    uploadButton.innerHTML = "upload file";
                    checkUploadButtonState();
                    appendLog(message, "error");
                    if (window.turnstile) turnstile.reset();
                  }
            
                  function resetUploadArea() {
                    fileInput.value = "";
                    checkUploadButtonState();
                    if (window.turnstile) turnstile.reset();
                  }
            
                  function checkAccessButtonState() {
                    if (fileNameInput.value.trim() === "") {
                      accessFileButton.disabled = true;
                    } else {
                      accessFileButton.disabled = false;
                    }
                  }
            
                  fileNameInput.addEventListener("input", checkAccessButtonState);
            
                  function redirectToFile() {
                    const fileName = fileNameInput.value.trim();
                    if (!fileName) {
                      alert("Please enter a file hash.");
                      return;
                    }
                    window.location.href = "/" + fileName;
                  }
            
                  function appendLog(message, type = "normal") {
                    const div = document.createElement("div");
                    div.textContent = message;
                    if (type === "error") {
                      const span = document.createElement("span");
                      span.className = "error";
                      span.textContent = "⚠️ " + message;
                      div.textContent = "";
                      div.appendChild(span);
                    } else if (type === "success") {
                      // Handle success specially to allow the link
                      div.innerHTML = message;
                    } else {
                      div.textContent = message;
                    }
                    outputDiv.appendChild(div);
                    outputDiv.scrollTop = outputDiv.scrollHeight;
                  }
            
                  checkUploadButtonState();
                  checkAccessButtonState();
                </script>
                <footer>
                  <p>
                    this was made by an indie developer. explore some other projects at
                    <a
                      href="https://www.kenf.dev"
                      target="_blank"
                      rel="noopener noreferrer"
                    >
                      www.kenf.dev </a
                    >.
                  </p>
                </footer>
              </body>
            </html>
        EOT -> (known after apply)
      ~ etag                          = "cb797d944d27b565292e89bcf3d17b5b" -> (known after apply)
        id                            = "index.html"
        tags                          = {}
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # cloudflare_record.cloudfront_to_ifs_cname will be destroyed
  # (because cloudflare_record.cloudfront_to_ifs_cname is not in configuration)
  - resource "cloudflare_record" "cloudfront_to_ifs_cname" {
      - allow_overwrite = false -> null
      - comment         = "GENERATED BY TERRAFORM - for cloudfront record" -> null
      - content         = "d2mt5hc1tbfa0q.cloudfront.net" -> null
      - created_on      = "2025-11-25T12:39:41.506659Z" -> null
      - hostname        = "ifs.kenf.dev" -> null
      - id              = "e18237ce958691807fc42c96469ad21a" -> null
      - metadata        = {} -> null
      - modified_on     = "2025-11-25T12:59:45.012976Z" -> null
      - name            = "ifs" -> null
      - proxiable       = true -> null
      - proxied         = true -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "CNAME" -> null
      - zone_id         = "47e2c26d25d25ff12cb21a0b2a5e1a4d" -> null
    }

  # cloudflare_record.cloudfront_to_subdomain_cname will be created
  + resource "cloudflare_record" "cloudfront_to_subdomain_cname" {
      + allow_overwrite = false
      + comment         = "GENERATED BY TERRAFORM - for cloudfront record"
      + content         = "d2mt5hc1tbfa0q.cloudfront.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ifs"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "47e2c26d25d25ff12cb21a0b2a5e1a4d"
    }

  # cloudflare_turnstile_widget.ifs_widget must be replaced
-/+ resource "cloudflare_turnstile_widget" "ifs_widget" {
      ~ bot_fight_mode = false -> (known after apply)
      ~ id             = "0x4AAAAAACC1jetWzl31A2VS" -> (known after apply)
      ~ name           = "IFS Turnstile Widget" -> "ifs Turnstile Widget"
      ~ region         = "world" # forces replacement -> (known after apply) # forces replacement
      ~ secret         = (sensitive value)
        # (4 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>